---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorResolved
source: html/c6370e50-b18f-e0f7-b62d-5898f4f85bda.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ErrorResolved Property

Error "[Text]" was automatically resolved by "[Resolution]"

## Syntax (C#)
```csharp
public static FailureDefinitionId ErrorResolved { get; }
```